<!-- eslint-disable vue/multi-word-component-names -->
<script setup lang="ts">
const vLazy = {
  mounted (el, binding, vnode, prevVnode) {
    console.log(el)
  }
}
</script>

<template>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <p>这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论这是商品评论</p>
  <img
    v-lazy
    src="@/assets/1.jpg"
    alt=""
  >
  <img
    src="@/assets/2.jpg"
    alt=""
  >
  <img
    src="@/assets/3.jpg"
    alt=""
  >
</template>

<style scoped>

</style>
